tototrix23/REPO_RLC_DRIVE/RA6T2_DRIVE/src/application/main/mtr_main.c
/***********************************************************************************************************************
* DISCLAIMER
* This software is supplied by Renesas Electronics Corporation and is only intended for use with Renesas products. No
* other uses are authorized. This software is owned by Renesas Electronics Corporation and is protected under all
* applicable laws, including copyright laws.
* THIS SOFTWARE IS PROVIDED "AS IS" AND RENESAS MAKES NO WARRANTIES REGARDING
* THIS SOFTWARE, WHETHER EXPRESS, IMPLIED OR STATUTORY, INCLUDING BUT NOT LIMITED TO WARRANTIES OF MERCHANTABILITY,
* FITNESS FOR A PARTICULAR PURPOSE AND NON-INFRINGEMENT. ALL SUCH WARRANTIES ARE EXPRESSLY DISCLAIMED. TO THE MAXIMUM
* EXTENT PERMITTED NOT PROHIBITED BY LAW, NEITHER RENESAS ELECTRONICS CORPORATION NOR ANY OF ITS AFFILIATED COMPANIES
* SHALL BE LIABLE FOR ANY DIRECT, INDIRECT, SPECIAL, INCIDENTAL OR CONSEQUENTIAL DAMAGES FOR ANY REASON RELATED TO THIS
* SOFTWARE, EVEN IF RENESAS OR ITS AFFILIATES HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
* Renesas reserves the right, without notice, to make changes to this software and to discontinue the availability of
* this software. By using this software, you agree to the additional terms and conditions found by accessing the
* following link:
* http://www.renesas.com/disclaimer
*
* Copyright (C) 2021 Renesas Electronics Corporation. All rights reserved.
***********************************************************************************************************************/
/***********************************************************************************************************************
* File Name   : mtr_main.c
* Description : The main function and the processes of motor control application layer
***********************************************************************************************************************/
/**********************************************************************************************************************
* History : DD.MM.YYYY Version
*         : 09.12.2021 1.00
***********************************************************************************************************************/

/***********************************************************************************************************************
* Includes <System Includes> , "Project Includes"
***********************************************************************************************************************/
#include <stdint.h>
#include "mtr_main.h"
#include "hal_data.h"
#include "rm_motor_api.h"

#include <hal_data.h>
#include <_core/c_common.h>
#include <_interfaces/i_spi/i_spi.h>
#include <_interfaces/i_time/i_time.h>
#include <_hal/h_drv8316/h_drv8316.h>
#include <_hal/h_time/h_time.h>
#include <_lib_impl_cust/impl_spi_motors/impl_spi_motors.h>
#include <_lib_impl_cust/impl_time/impl_time.h>
#include <adc.h>

#define ALT_MOT



#define     CONF_MOTOR_TYPE ("Brushless DC Motor")
#define     CONF_CONTROL ("Hall 120 degree control (Speed control)")
#define     CONF_INVERTER ("MCI-LV-1")
#define     CONF_MOTOR_TYPE_LEN (18)
#define     CONF_CONTROL_LEN (39)
#define     CONF_INVERTER_LEN (8)
/***********************************************************************************************************************
* Global variables
***********************************************************************************************************************/
float       g_f4_speed_ref = 0;
uint8_t     g_u1_motor0_status;                    /* Motor status */
uint8_t     g_u1_motor1_status;                    /* Motor status */

uint8_t     com_u1_sw_userif;                     /* User interface switch */
uint8_t     g_u1_sw_userif;                       /* User interface switch */
uint8_t     com_u1_mode_system;                   /* System mode */
uint8_t     g_u1_mode_system;                     /* System mode */
float       g_f4_max_speed_rpm;
uint8_t     g_u1_stop_req;
uint16_t    g_u2_chk_error0;
uint16_t    g_u2_chk_error1;
uint16_t    g_u2_conf_hw;
uint16_t    g_u2_conf_sw;
uint16_t    g_u2_conf_tool;
uint8_t     g_u1_conf_motor_type_len;
uint8_t     g_u1_conf_control_len;
uint8_t     g_u1_conf_inverter_len;
uint8_t     g_u1_conf_motor_type[CONF_MOTOR_TYPE_LEN];
uint8_t     g_u1_conf_control[CONF_CONTROL_LEN];
uint8_t     g_u1_conf_inverter[CONF_INVERTER_LEN];
uint8_t     g_u1_reset_req;                       /* Reset request flag */
uint8_t     g_u1_sw_cnt;                          /* Counter to remove chattering */

motor_cfg_t g_user_motor_cfg;
motor_120_degree_extended_cfg_t g_user_motor_120_degree_extended_cfg;
motor_120_control_cfg_t g_user_motor_120_control_cfg;
motor_120_control_hall_extended_cfg_t g_user_motor_120_control_extended_cfg;
motor_120_driver_cfg_t g_user_motor_120_driver_cfg;
motor_120_driver_extended_cfg_t g_user_motor_120_driver_extended_cfg;

motor_cfg_t g_user_motor1_cfg;
motor_120_degree_extended_cfg_t g_user_motor1_120_degree_extended_cfg;
motor_120_control_cfg_t g_user_motor1_120_control_cfg;
motor_120_control_hall_extended_cfg_t g_user_motor1_120_control_extended_cfg;
motor_120_driver_cfg_t g_user_motor1_120_driver_cfg;
motor_120_driver_extended_cfg_t g_user_motor1_120_driver_extended_cfg;


motor_wait_stop_flag_t g_wait_flag;



h_drv8316_t drv_mot1;
h_drv8316_t drv_mot2;
i_spi_t interface_mot1;
i_spi_t interface_mot2;


/***********************************************************************************************************************
* Private functions
***********************************************************************************************************************/
static void     motor_fsp_init (void);

static uint8_t  mtr_remove_sw_chattering (uint8_t u1_sw, uint8_t u1_on_off);
static void     board_ui (void);           /* Board user interface */

static void     software_init (void);      /* Software initialize */
static void gpt_periodset (timer_ctrl_t * const p_ctrl, uint32_t const period_counts, uint32_t const value);

void custom_adc_interrupt(adc_callback_args_t * p_args);


volatile motor_instance_t g_motor_120_degree0_ext;
volatile motor_instance_t g_motor_120_degree1_ext;
volatile motor_120_driver_cfg_t conf0;
volatile motor_120_driver_extended_cfg_t ext0;
volatile motor_120_driver_cfg_t conf1;
volatile motor_120_driver_extended_cfg_t ext1;

