tototrix23/REPO_RLC_DRIVE/RA6T2_DRIVE/src/application/main/mtr_main.c
timer_instance_t mot0_g_timer0;
timer_cfg_t mot0_g_timer0_cfg;
timer_instance_t mot0_g_timer1;
timer_cfg_t mot0_g_timer1_cfg;
motor_120_driver_extended_cfg_t g_mot_120_driver0_extend;
motor_120_driver_cfg_t g_mot_120_driver0_cfg;
motor_120_driver_instance_ctrl_t g_mot_120_driver0_ctrl;
motor_120_driver_instance_t g_mot_120_driver0;
motor_120_control_hall_instance_ctrl_t g_mot_120_control_hall0_ctrl;
extern const motor_120_control_hall_extended_cfg_t g_motor_120_control_hall0_extend;
motor_120_control_hall_extended_cfg_t g_mot_120_control_hall0_extend;
motor_120_control_cfg_t g_mot_120_control_hall0_cfg;
motor_120_control_instance_t g_mot_120_control_hall0;
motor_120_degree_instance_ctrl_t g_mot_120_degree0_ctrl;
extern const motor_120_degree_extended_cfg_t g_motor_120_degree0_extend;
motor_120_degree_extended_cfg_t g_mot_120_degree0_extend;
motor_cfg_t g_mot_120_degree0_cfg;
motor_instance_t g_mot_120_degree0;

timer_instance_t mot1_g_timer0;
timer_cfg_t mot1_g_timer0_cfg;
timer_instance_t mot1_g_timer1;
timer_cfg_t mot1_g_timer1_cfg;
motor_120_driver_extended_cfg_t g_mot_120_driver1_extend;
motor_120_driver_cfg_t g_mot_120_driver1_cfg;
motor_120_driver_instance_ctrl_t g_mot_120_driver1_ctrl;
motor_120_driver_instance_t g_mot_120_driver1;
motor_120_control_hall_instance_ctrl_t g_mot_120_control_hall1_ctrl;
extern const motor_120_control_hall_extended_cfg_t g_motor_120_control_hall1_extend;
motor_120_control_hall_extended_cfg_t g_mot_120_control_hall1_extend;
motor_120_control_cfg_t g_mot_120_control_hall1_cfg;
motor_120_control_instance_t g_mot_120_control_hall1;
motor_120_degree_instance_ctrl_t g_mot_120_degree1_ctrl;
extern const motor_120_degree_extended_cfg_t g_motor_120_degree1_extend;
motor_120_degree_extended_cfg_t g_mot_120_degree1_extend;
motor_cfg_t g_mot_120_degree1_cfg;
motor_instance_t g_mot_120_degree1;
void motor_structures_init(void);

i_time_t i_time_interface_t;
c_timespan_t ts0;
c_timespan_t ts1;


/***********************************************************************************************************************
* Function Name : mtr_init
* Description   : Initialization for Motor Control
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void mtr_init(void)
{
   volatile int i=0;

   R_BSP_SoftwareDelay(500, BSP_DELAY_UNITS_MILLISECONDS);
   R_IOPORT_PinWrite(&g_ioport_ctrl, VM_CMD,BSP_IO_LEVEL_HIGH );
   R_BSP_SoftwareDelay(200, BSP_DELAY_UNITS_MILLISECONDS);






   i_spi_init(&interface_mot1, spi_motor_open, spi_motor_close, spi_motor_read, spi_motor_write, spi_motor_mot1_cs_inactive, spi_motor_mot1_cs_active);
   i_spi_init(&interface_mot2, spi_motor_open, spi_motor_close, spi_motor_read, spi_motor_write, spi_motor_mot2_cs_inactive, spi_motor_mot2_cs_active);

  volatile return_t ret = h_drv8316_init(&drv_mot1,&interface_mot1,FALSE);
  ret = h_drv8316_init(&drv_mot2,&interface_mot2,FALSE);

  ret = h_drv8316_read_all_registers(&drv_mot1);
  drv_mot1.registers.ctrl2.bits.SLEW = 2;
  drv_mot1.registers.ctrl2.bits.PWM_MODE = 0;
  drv_mot1.registers.ctrl4.bits.OCP_MODE = 0;
  drv_mot1.registers.ctrl4.bits.OCP_DEG = 0;
  drv_mot1.registers.ctrl4.bits.OCP_LVL = 0;
  drv_mot1.registers.ctrl5.bits.CSA_GAIN = 0;
  drv_mot1.registers.ctrl5.bits.EN_AAR = 0;
  drv_mot1.registers.ctrl5.bits.EN_ASR = 0;
  drv_mot1.registers.ctrl10.bits.DLY_TARGET = 0x8;
  drv_mot1.registers.ctrl10.bits.DLYCMP_EN = 1;
  ret = h_drv8316_write_all_registers(&drv_mot1);
  ret = h_drv8316_read_all_registers(&drv_mot1);


  ret = h_drv8316_read_all_registers(&drv_mot2);
  drv_mot2.registers.ctrl2.bits.SLEW = 2;
  drv_mot2.registers.ctrl2.bits.PWM_MODE = 0;
  drv_mot2.registers.ctrl4.bits.OCP_MODE = 0;
  drv_mot2.registers.ctrl4.bits.OCP_DEG = 2;
  drv_mot2.registers.ctrl5.bits.CSA_GAIN = 0;
  drv_mot2.registers.ctrl5.bits.EN_AAR = 0;
  drv_mot2.registers.ctrl5.bits.EN_ASR = 0;
  drv_mot2.registers.ctrl10.bits.DLY_TARGET = 8;
  drv_mot2.registers.ctrl10.bits.DLYCMP_EN = 1;
  ret = h_drv8316_write_all_registers(&drv_mot2);
  ret = h_drv8316_read_all_registers(&drv_mot2);

  motor_fsp_init();

} /* End of function mtr_init() */



/***********************************************************************************************************************
* Function Name : mtr_main
* Description   : Main routine for Motor Control
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
void mtr_main(void)
{
    board_ui();
} /* End of function mtr_main() */

#ifdef ALT_MOT
static void board_ui(void)
{


    static uint8_t state0 = 0;

    uint8_t u1_temp_sw_signal;
    motor_120_control_wait_stop_flag_t u1_temp_flg_wait_stop = MOTOR_120_CONTROL_WAIT_STOP_FLAG_SET;


    g_mot_120_degree0.p_api->statusGet(g_mot_120_degree0.p_ctrl, &g_u1_motor0_status);
    switch (g_u1_motor0_status)
    {
        case MOTOR_120_DEGREE_CTRL_STATUS_STOP:
        {
            while (MOTOR_120_CONTROL_WAIT_STOP_FLAG_SET == u1_temp_flg_wait_stop)
            {

                g_mot_120_degree0.p_api->waitStopFlagGet(g_mot_120_degree0.p_ctrl, &u1_temp_flg_wait_stop);
            }
            g_mot_120_degree0.p_api->run(g_mot_120_degree0.p_ctrl);
        }
        break;

        case MOTOR_120_DEGREE_CTRL_STATUS_RUN:
        {

        }
        break;

        case MOTOR_120_DEGREE_CTRL_STATUS_ERROR:
        {
            //R_IOPORT_PinWrite(&g_ioport_ctrl, VM_CMD,BSP_IO_LEVEL_LOW );
            //volatile return_t ret = h_drv8316_read_all_registers(&drv_mot1);
            g_mot_120_degree0.p_api->errorCheck(g_mot_120_degree0.p_ctrl, &g_u2_chk_error0);


                volatile uint8_t i=0;

        }
        break;

        default:
        {

        }
        break;
    }
    g_f4_speed_ref = 800.0;
    g_u1_stop_req = MTR_FLG_CLR;
    //g_mot_120_degree0.p_api->speedSet(g_mot_120_degree0.p_ctrl, (float)g_f4_speed_ref);



    motor_ext_settings_t settings;
    settings.current_max = 0.0f;
    settings.timeout_hall_ms = 0;
    bool_t result = FALSE;
    if (state0 == 0)
    {
        h_time_is_elapsed_ms (&ts0, 2500, &result);
        if (result == TRUE)
        {
            settings.percent = -20;
            g_mot_120_degree0.p_api->speedSetOpenLoop (g_mot_120_degree0.p_ctrl, settings);
            h_time_update (&ts0);
            state0 = 1;
        }
    }
    else if (state0 == 1)
    {
        h_time_is_elapsed_ms (&ts0, 5000, &result);
        if (result == TRUE)
        {
            settings.percent = -50;
            g_mot_120_degree0.p_api->speedSetOpenLoop (g_mot_120_degree0.p_ctrl, settings);
            h_time_update (&ts0);
            state0 = 2;
        }
    }
    else if (state0 == 2)
    {
        h_time_is_elapsed_ms (&ts0, 5000, &result);
        if (result == TRUE)
        {
            //settings.percent = -35;
            //g_mot_120_degree0.p_api->speedSetOpenLoop (g_mot_120_degree0.p_ctrl, settings);
            g_f4_speed_ref = -1500;
            g_mot_120_degree0.p_api->speedSet (g_mot_120_degree0.p_ctrl, (float) g_f4_speed_ref);
            h_time_update (&ts0);
            state0 = 3;
        }
    }
    else if (state0 == 3)
    {
        h_time_is_elapsed_ms (&ts0, 5000, &result);
        if (result == TRUE)
        {
            //settings.percent = -35;
            //g_mot_120_degree0.p_api->speedSetOpenLoop (g_mot_120_degree0.p_ctrl, settings);
            g_f4_speed_ref = -3000;
            g_mot_120_degree0.p_api->speedSet (g_mot_120_degree0.p_ctrl, (float) g_f4_speed_ref);
            h_time_update (&ts0);
            state0 = 0;
        }
    }




