tototrix23/REPO_RLC_DRIVE/RA6T2_DRIVE/src/application/main/mtr_main.c
    u1_temp_flg_wait_stop = MOTOR_120_CONTROL_WAIT_STOP_FLAG_SET;
    g_mot_120_degree1.p_api->statusGet(g_mot_120_degree1.p_ctrl, &g_u1_motor1_status);
    switch (g_u1_motor1_status)
    {
        case MOTOR_120_DEGREE_CTRL_STATUS_STOP:
        {
            while (MOTOR_120_CONTROL_WAIT_STOP_FLAG_SET == u1_temp_flg_wait_stop)
            {

                g_mot_120_degree1.p_api->waitStopFlagGet(g_mot_120_degree1.p_ctrl, &u1_temp_flg_wait_stop);
            }
            //g_mot_120_degree1.p_api->run(g_mot_120_degree1.p_ctrl);
        }
        break;

        case MOTOR_120_DEGREE_CTRL_STATUS_RUN:
        {

        }
        break;

        case MOTOR_120_DEGREE_CTRL_STATUS_ERROR:
        {
            //R_IOPORT_PinWrite(&g_ioport_ctrl, VM_CMD,BSP_IO_LEVEL_LOW );
            //volatile return_t ret = h_drv8316_read_all_registers(&drv_mot1);
            g_mot_120_degree1.p_api->errorCheck(g_mot_120_degree1.p_ctrl, &g_u2_chk_error1);


                volatile uint8_t i=0;

        }
        break;

        default:
        {

        }
        break;
    }
    g_f4_speed_ref = 800.0;
    g_u1_stop_req = MTR_FLG_CLR;
    //g_mot_120_degree1.p_api->speedSet(g_mot_120_degree1.p_ctrl, (float)g_f4_speed_ref);


    settings.current_max = 0.0f;
    settings.timeout_hall_ms = 0;
    settings.percent = 20;
    g_mot_120_degree1.p_api->speedSetOpenLoop(g_mot_120_degree1.p_ctrl,settings);

}
#else
static void board_ui(void)
{
    uint8_t u1_temp_sw_signal;
    motor_120_control_wait_stop_flag_t u1_temp_flg_wait_stop = MOTOR_120_CONTROL_WAIT_STOP_FLAG_SET;

    /* Get status of motor control system */
    g_motor_120_degree0.p_api->statusGet(g_motor_120_degree0.p_ctrl, &g_u1_motor0_status);
    switch (g_u1_motor0_status)
    {
        case MOTOR_120_DEGREE_CTRL_STATUS_STOP:
        {
            while (MOTOR_120_CONTROL_WAIT_STOP_FLAG_SET == u1_temp_flg_wait_stop)
            {
                /* waiting for motor stop */
                g_motor_120_degree0.p_api->waitStopFlagGet(g_motor_120_degree0.p_ctrl, &u1_temp_flg_wait_stop);
            }
            g_motor_120_degree0.p_api->run(g_motor_120_degree0.p_ctrl);
        }
        break;

        case MOTOR_120_DEGREE_CTRL_STATUS_RUN:
        {
            /*u1_temp_sw_signal = get_sw1();

            if ((MTR_FLG_SET == mtr_remove_sw_chattering(u1_temp_sw_signal, SW1_OFF)) || (MTR_FLG_CLR != g_u1_stop_req))
            {
                g_motor_120_degree0.p_api->stop(g_motor_120_degree0.p_ctrl);
            }*/
        }
        break;

        case MOTOR_120_DEGREE_CTRL_STATUS_ERROR:
        {
            R_IOPORT_PinWrite(&g_ioport_ctrl, VM_CMD,BSP_IO_LEVEL_LOW );
            //volatile return_t ret = h_drv8316_read_all_registers(&drv_mot1);
            g_motor_120_degree0.p_api->errorCheck(g_motor_120_degree0.p_ctrl, &g_u2_chk_error0);
            while(1)
            {

                volatile uint8_t i=0;
            }
        }
        break;

        default:
        {
            /* Do nothing */
        }
        break;
    }
    g_f4_speed_ref = 1000.0;
    g_u1_stop_req = MTR_FLG_CLR;
    g_motor_120_degree0.p_api->speedSet(g_motor_120_degree0.p_ctrl, (float)g_f4_speed_ref);
}
#endif

/***********************************************************************************************************************
* Function Name : software_init
* Description   : Initialize private global variables
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/

/***********************************************************************************************************************
* Function Name : g_poe_overcurrent
* Description   : POEG2 Interrupt callback function
* Arguments     : p_args - Callback argument
* Return Value  : None
***********************************************************************************************************************/
void g_poe_overcurrent(poeg_callback_args_t *p_args)
{
    if (NULL != p_args)
    {
        R_POEG_Reset(g_poeg0.p_ctrl);
#ifdef ALT_MOT
        g_mot_120_degree0.p_api->errorSet(g_mot_120_degree0.p_ctrl, MOTOR_ERROR_OVER_CURRENT_HW);
#else
        g_motor_120_degree0.p_api->errorSet(g_motor_120_degree0.p_ctrl, MOTOR_ERROR_OVER_CURRENT_HW);
#endif
        g_u2_chk_error0 |= MOTOR_ERROR_OVER_CURRENT_HW;
    }
} /* End of function g_poe_overcurrent */





void custom_adc_init(void)
{
    volatile fsp_err_t err = FSP_SUCCESS;
    //err = R_ADC_B_Close(&g_adc_external_ctrl);
    err = R_ADC_B_Open(&g_adc_external_ctrl, &g_adc_external_cfg);
    err = R_ADC_B_ScanCfg(&g_adc_external_ctrl, &g_adc_external_scan_cfg);
    err = R_ADC_B_Calibrate(&g_adc_external_ctrl, NULL);
    R_BSP_SoftwareDelay(10, BSP_DELAY_UNITS_MILLISECONDS);
    err= R_ADC_B_ScanStart(&g_adc_external_ctrl);
}

void custom_adc_capture(void)
{
    volatile fsp_err_t err = R_ADC_B_ScanGroupStart(&g_adc_external_ctrl,ADC_GROUP_MASK_8);
    volatile uint8_t i=0;
}

void custom_adc_interrupt(adc_callback_args_t *p_args)
{


    if (p_args->event == ADC_EVENT_SCAN_COMPLETE)
    {
        if (p_args->group_mask == ADC_GROUP_MASK_0)
        {
#ifdef ALT_MOT
            p_args->p_context = &g_mot_120_driver0;
#else
            p_args->p_context = &g_motor_120_driver0;
#endif
            rm_motor_120_driver_cyclic(p_args);
        }
        if (p_args->group_mask == ADC_GROUP_MASK_2)
        {
#ifdef ALT_MOT
            p_args->p_context = &g_mot_120_driver1;
#else
            p_args->p_context = &g_motor_120_driver1;
#endif
            rm_motor_120_driver_cyclic(p_args);
        }
        if (p_args->group_mask == ADC_GROUP_MASK_8)
        {
            volatile uint8_t i=0;
            volatile uint16_t data[2] = {0};
            R_ADC_B_Read(&g_adc_external_ctrl, 14,&data[0]);
            R_ADC_B_Read(&g_adc_external_ctrl, 15,&data[1]);
            i=0;

        }
    }
    else if(p_args->event == ADC_EVENT_CALIBRATION_COMPLETE || p_args->event == ADC_EVENT_CALIBRATION_REQUEST)
    {
        return;
    }
    else
    {
        volatile uint8_t i=0;
    }
}




void motor_structures_init(void)
{

