tototrix23/REPO_RLC_DRIVE/RA6T2_DRIVE/src/application/main/mtr_main.c
    //---------------------------------------------------------------------
    // MOTOR0
    //---------------------------------------------------------------------
    memcpy(&mot0_g_timer0_cfg,&g_timer3_cfg,sizeof(timer_cfg_t));
    mot0_g_timer0_cfg.p_context = &g_mot_120_control_hall0;
    memcpy(&mot0_g_timer0,&g_timer3,sizeof(timer_instance_t));
    mot0_g_timer0.p_cfg  =&mot0_g_timer0_cfg;

    memcpy(&mot0_g_timer1_cfg,&g_timer4_cfg,sizeof(timer_cfg_t));
    mot0_g_timer1_cfg.p_context = &g_mot_120_control_hall0;
    memcpy(&mot0_g_timer1,&g_timer4,sizeof(timer_instance_t));
    mot0_g_timer1.p_cfg  =&mot0_g_timer1_cfg;

    // DRIVER
    memcpy(&g_mot_120_driver0_extend,&g_motor_120_driver0_extend,sizeof(motor_120_driver_extended_cfg_t));
    g_mot_120_driver0_extend.p_adc_instance = &g_adc_external;

    memcpy(&g_mot_120_driver0_cfg,&g_motor_120_driver0_cfg,sizeof(motor_120_driver_cfg_t));
    g_mot_120_driver0_cfg.p_extend = &g_mot_120_driver0_extend;
    g_mot_120_driver0_cfg.p_context = &g_mot_120_control_hall0;
    g_mot_120_driver0.p_ctrl = &g_mot_120_driver0_ctrl;
    g_mot_120_driver0.p_cfg = &g_mot_120_driver0_cfg;
    g_mot_120_driver0.p_api = &g_motor_120_driver_on_motor_120_driver;

    //HALL
    memcpy(&g_mot_120_control_hall0_extend,&g_motor_120_control_hall0_extend,sizeof(motor_120_control_hall_extended_cfg_t));
    g_mot_120_control_hall0_extend.p_motor_120_driver_instance = &g_mot_120_driver0;
    g_mot_120_control_hall0_extend.p_speed_cyclic_timer_instance = &mot0_g_timer0;
    g_mot_120_control_hall0_extend.p_speed_calc_timer_instance = &mot0_g_timer1;
    memcpy(&g_mot_120_control_hall0_cfg,&g_motor_120_control_hall0_cfg,sizeof(motor_120_control_cfg_t));

    g_mot_120_control_hall0_cfg.p_context = &g_mot_120_degree0;
    g_mot_120_control_hall0_cfg.p_extend = &g_mot_120_control_hall0_extend;

    memcpy(&g_mot_120_control_hall0,&g_motor_120_control_hall0,sizeof(motor_120_control_instance_t));
    g_mot_120_control_hall0.p_ctrl = &g_mot_120_control_hall0_ctrl;
    g_mot_120_control_hall0.p_cfg = &g_mot_120_control_hall0_cfg;
    g_mot_120_control_hall0.p_api = &g_motor_120_control_on_motor_120_control_hall;

    //MOTOR
    memcpy(&g_mot_120_degree0_extend,&g_motor_120_degree0_extend,sizeof(motor_120_degree_extended_cfg_t));
    g_mot_120_degree0_extend.p_motor_120_control_instance = &g_mot_120_control_hall0;

    memcpy(&g_mot_120_degree0_cfg,&g_motor_120_degree0_cfg,sizeof(motor_cfg_t));
    g_mot_120_degree0_cfg.p_extend = &g_mot_120_degree0_extend;

    g_mot_120_degree0.p_ctrl = &g_mot_120_degree0_ctrl;
    g_mot_120_degree0.p_cfg = &g_mot_120_degree0_cfg;
    g_mot_120_degree0.p_api =  &g_motor_on_motor_120_degree;

    //---------------------------------------------------------------------
    // MOTOR1
    //---------------------------------------------------------------------
    memcpy(&mot1_g_timer0_cfg,&g_timer8_cfg,sizeof(timer_cfg_t));
    mot1_g_timer0_cfg.p_context = &g_mot_120_control_hall1;
    memcpy(&mot1_g_timer0,&g_timer8,sizeof(timer_instance_t));
    mot1_g_timer0.p_cfg  =&mot1_g_timer0_cfg;

    memcpy(&mot1_g_timer1_cfg,&g_timer9_cfg,sizeof(timer_cfg_t));
    mot1_g_timer1_cfg.p_context = &g_mot_120_control_hall1;
    memcpy(&mot1_g_timer1,&g_timer9,sizeof(timer_instance_t));
    mot1_g_timer1.p_cfg  =&mot1_g_timer1_cfg;
    // DRIVER
    memcpy(&g_mot_120_driver1_extend,&g_motor_120_driver1_extend,sizeof(motor_120_driver_extended_cfg_t));
    g_mot_120_driver1_extend.p_adc_instance = &g_adc_external;

    memcpy(&g_mot_120_driver1_cfg,&g_motor_120_driver1_cfg,sizeof(motor_120_driver_cfg_t));
    g_mot_120_driver1_cfg.p_extend = &g_mot_120_driver1_extend;
    g_mot_120_driver1_cfg.p_context = &g_mot_120_control_hall1;

    g_mot_120_driver1.p_ctrl = &g_mot_120_driver1_ctrl;
    g_mot_120_driver1.p_cfg = &g_mot_120_driver1_cfg;
    g_mot_120_driver1.p_api = &g_motor_120_driver_on_motor_120_driver;

    //HALL
    memcpy(&g_mot_120_control_hall1_extend,&g_motor_120_control_hall1_extend,sizeof(motor_120_control_hall_extended_cfg_t));
    g_mot_120_control_hall1_extend.p_motor_120_driver_instance = &g_mot_120_driver1;
    g_mot_120_control_hall1_extend.p_speed_cyclic_timer_instance = &mot1_g_timer0;
    g_mot_120_control_hall1_extend.p_speed_calc_timer_instance = &mot1_g_timer1;
    memcpy(&g_mot_120_control_hall1_cfg,&g_motor_120_control_hall1_cfg,sizeof(motor_120_control_cfg_t));
    g_mot_120_control_hall1_cfg.p_context = &g_mot_120_degree1;
    g_mot_120_control_hall1_cfg.p_extend = &g_mot_120_control_hall1_extend;

    memcpy(&g_mot_120_control_hall1,&g_motor_120_control_hall1,sizeof(motor_120_control_instance_t));
    g_mot_120_control_hall1.p_ctrl = &g_mot_120_control_hall1_ctrl;
    g_mot_120_control_hall1.p_cfg = &g_mot_120_control_hall1_cfg;
    g_mot_120_control_hall1.p_api = &g_motor_120_control_on_motor_120_control_hall;

    //MOTOR
    memcpy(&g_mot_120_degree1_extend,&g_motor_120_degree1_extend,sizeof(motor_120_degree_extended_cfg_t));
    g_mot_120_degree1_extend.p_motor_120_control_instance = &g_mot_120_control_hall1;

    memcpy(&g_mot_120_degree1_cfg,&g_motor_120_degree1_cfg,sizeof(motor_cfg_t));
    g_mot_120_degree1_cfg.p_extend = &g_mot_120_degree1_extend;

    g_mot_120_degree1.p_ctrl = &g_mot_120_degree1_ctrl;
    g_mot_120_degree1.p_cfg = &g_mot_120_degree1_cfg;
    g_mot_120_degree1.p_api =  &g_motor_on_motor_120_degree;



}

/***********************************************************************************************************************
* Function Name : motor_fsp_init
* Description   : Initialize Motor FSP modules
* Arguments     : None
* Return Value  : None
***********************************************************************************************************************/
static void motor_fsp_init(void)
{


    impl_time_init();
    i_time_init(&i_time_interface_t,impl_time_init, impl_time_update);
    h_time_init(&i_time_interface_t);

    c_timespan_init(&ts0);
    c_timespan_init(&ts1);
    h_time_update(&ts0);
    h_time_update(&ts1);


