tototrix23/REPO_RLC_DRIVE/RA6T2_DRIVE/src/application/main/mtr_main.c
    motor_structures_init();

    motor_ext_cfg_t mot_ext_cfg;
    mot_ext_cfg.motor_type = MOTOR_TYPE_BLDC;
    mot_ext_cfg.pulses_counting_reverse = 0;


    R_POEG_Open(g_poeg0.p_ctrl, g_poeg0.p_cfg);

    /* ADC, GPT Three Phase */
    custom_adc_init();
#ifdef ALT_MOT
    g_mot_120_degree0.p_api->open(g_mot_120_degree0.p_ctrl, g_mot_120_degree0.p_cfg);
    g_mot_120_degree0.p_api->configSet(g_mot_120_degree0.p_ctrl,mot_ext_cfg);
    g_mot_120_degree0.p_api->pulsesSet(g_mot_120_degree0.p_ctrl,0);
    g_mot_120_degree0.p_api->statusGet(g_mot_120_degree0.p_ctrl, &g_u1_motor0_status);
    g_mot_120_degree1.p_api->open(g_mot_120_degree1.p_ctrl, g_mot_120_degree1.p_cfg);
    g_mot_120_degree1.p_api->configSet(g_mot_120_degree1.p_ctrl,mot_ext_cfg);
    g_mot_120_degree1.p_api->pulsesSet(g_mot_120_degree1.p_ctrl,0);
    //g_mot_120_degree1.p_api->statusGet(g_mot_120_degree1.p_ctrl, &g_u1_motor1_status);
#else
    g_motor_120_degree0.p_api->open(g_motor_120_degree0.p_ctrl, g_motor_120_degree0.p_cfg);
    g_motor_120_degree0.p_api->statusGet(g_motor_120_degree0.p_ctrl, &g_u1_motor0_status);
    g_motor_120_degree1.p_api->open(g_motor_120_degree1.p_ctrl, g_motor_120_degree1.p_cfg);
    //g_motor_120_degree1.p_api->statusGet(g_motor_120_degree1.p_ctrl, &g_u1_motor0_status);
#endif

    //custom_adc_init();



    R_GPT_THREE_PHASE_Stop(g_three_phase0.p_ctrl);
    R_GPT_THREE_PHASE_Stop(g_three_phase1.p_ctrl);

    R_GPT_THREE_PHASE_Reset(g_three_phase0.p_ctrl);
    R_GPT_THREE_PHASE_Reset(g_three_phase1.p_ctrl);
    gpt_periodset(g_timer0.p_ctrl,g_timer0.p_cfg->period_counts,(uint32_t)(g_timer0.p_cfg->period_counts));
    gpt_periodset(g_timer1.p_ctrl,g_timer1.p_cfg->period_counts,(uint32_t)(g_timer1.p_cfg->period_counts));
    gpt_periodset(g_timer2.p_ctrl,g_timer2.p_cfg->period_counts,(uint32_t)(g_timer2.p_cfg->period_counts));
    gpt_periodset(g_timer5.p_ctrl,g_timer5.p_cfg->period_counts,(uint32_t)((float)g_timer5.p_cfg->period_counts*1.5f));
    gpt_periodset(g_timer6.p_ctrl,g_timer6.p_cfg->period_counts,(uint32_t)((float)g_timer6.p_cfg->period_counts*1.5f));
    gpt_periodset(g_timer7.p_ctrl,g_timer7.p_cfg->period_counts,(uint32_t)((float)g_timer7.p_cfg->period_counts*1.5f));
    R_GPT_THREE_PHASE_Start(g_three_phase0.p_ctrl);
    R_GPT_THREE_PHASE_Start(g_three_phase1.p_ctrl);
    g_mot_120_degree0.p_api->reset(g_mot_120_degree0.p_ctrl);
    g_mot_120_degree1.p_api->reset(g_mot_120_degree1.p_ctrl);
    R_BSP_SoftwareDelay(200, BSP_DELAY_UNITS_MILLISECONDS);



    //g_mot_120_degree0.p_api->stop(g_mot_120_degree0.p_ctrl);
    //g_mot_120_degree1.p_api->brake(g_mot_120_degree1.p_ctrl);

    //while(1);

} /* End of function motor_fsp_init */

/***********************************************************************************************************************
* Function Name : mtr_callback_120_degree
* Description   : Callback function of Less 120 Control
* Arguments     : p_args - Callback argument
* Return Value  : None
***********************************************************************************************************************/
void mtr0_callback_120_degree(motor_callback_args_t * p_args)
{
    switch (p_args->event)
    {
        case MOTOR_CALLBACK_EVENT_ADC_FORWARD:
        {
            /* Do nothing */
        }
        break;

        case MOTOR_CALLBACK_EVENT_ADC_BACKWARD:
        {
            if (MOTOR_120_DEGREE_CTRL_STATUS_ERROR != g_u1_motor0_status)
            {
#ifdef ALT_MOT
                g_mot_120_degree0.p_api->errorCheck(g_mot_120_degree0.p_ctrl, &g_u2_chk_error0);
#else
                g_motor_120_degree0.p_api->errorCheck(g_motor_120_degree0.p_ctrl, &g_u2_chk_error0);
#endif
            }

            //mtr_ics_interrupt_process();
        }
        break;

        case MOTOR_CALLBACK_EVENT_CYCLE_FORWARD:
        {
            /* Do nothing */
        }
        break;

        case MOTOR_CALLBACK_EVENT_CYCLE_BACKWARD:
        {
            /* Do nothing */
        }
        break;



        default:
        {
            /* Do nothing */
        }
        break;
    }
} /* End of function mtr_callback_120_degree */



void mtr1_callback_120_degree(motor_callback_args_t * p_args)
{
    switch (p_args->event)
    {
        case MOTOR_CALLBACK_EVENT_ADC_FORWARD:
        {
            /* Do nothing */
        }
        break;

        case MOTOR_CALLBACK_EVENT_ADC_BACKWARD:
        {
            if (MOTOR_120_DEGREE_CTRL_STATUS_ERROR != g_u1_motor1_status)
            {
#ifdef ALT_MOT
                g_mot_120_degree1.p_api->errorCheck(g_mot_120_degree1.p_ctrl, &g_u2_chk_error1);
#else
                g_motor_120_degree1.p_api->errorCheck(g_motor_120_degree1.p_ctrl, &g_u2_chk_error1);
#endif
            }

            //mtr_ics_interrupt_process();
        }
        break;

        case MOTOR_CALLBACK_EVENT_CYCLE_FORWARD:
        {
            /* Do nothing */
        }
        break;

        case MOTOR_CALLBACK_EVENT_CYCLE_BACKWARD:
        {
            /* Do nothing */
        }
        break;



        default:
        {
            /* Do nothing */
        }
        break;
    }
} /* End of function mtr_callback_120_degree */


/***********************************************************************************************************************
* Function Name : mtr_board_led_control
* Description   : Set LED pattern depend on motor status
* Arguments     : u1_motor_status - Motor control status
* Return Value  : None
***********************************************************************************************************************/


/***********************************************************************************************************************
* Function Name : mtr_remove_sw_chattering
* Description   : Get switch status with removing chattering
* Arguments     : u1_sw - Board interface switch signal
*                 u1_on_off - Detected status (ON/OFF)
* Return Value  : u1_remove_chattering_flg - Detection result
***********************************************************************************************************************/
static uint8_t mtr_remove_sw_chattering(uint8_t u1_sw, uint8_t u1_on_off)
{
    uint8_t u1_remove_chattering_flg;

    u1_remove_chattering_flg = 0;
    if (u1_on_off == u1_sw)
    {
        g_u1_sw_cnt++;
        if (CHATTERING_CNT < g_u1_sw_cnt)
        {
            u1_remove_chattering_flg = MTR_FLG_SET;
            g_u1_sw_cnt = 0;
        }
    }
    else
    {
        g_u1_sw_cnt = 0;
    }

    return (u1_remove_chattering_flg);
} /* End of function mtr_remove_sw_chattering */


static void gpt_periodset (timer_ctrl_t * const p_ctrl, uint32_t const period_counts, uint32_t const value)
{
    gpt_instance_ctrl_t * p_instance_ctrl = (gpt_instance_ctrl_t *) p_ctrl;

    p_instance_ctrl->p_reg->GTPBR = period_counts;          /* Set period to buffer register */
    p_instance_ctrl->p_reg->GTPR = (uint32_t)(value);
}

